; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 559600 2 3 2 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	image0 - mode
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star6 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(have_image Planet8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Star10 image0)
	(have_image Phenomenon11 infrared1)
	(have_image Planet12 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
3. (turn_to satellite0 star10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star10)
   goals met: 0 of 5
4. (turn_to satellite1 groundstation1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 5
5. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 5
6. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 0 of 5
7. (turn_to satellite1 star10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star10)
   goals met: 0 of 5
8. (turn_to satellite0 planet12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet12)
   goals met: 0 of 5
9. (take_image satellite1 star10 instrument3 image0)
   added: (have_image star10 image0)
   goals met: 1 of 5
10. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 1 of 5
11. (turn_to satellite1 planet8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet8)
   goals met: 1 of 5
12. (turn_to satellite0 phenomenon11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 5
13. (take_image satellite1 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 5
14. (turn_to satellite0 planet9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet9)
   goals met: 2 of 5
15. (turn_to satellite1 planet12 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet12)
   goals met: 2 of 5
16. (turn_to satellite0 phenomenon11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 5
17. (take_image satellite1 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 3 of 5
18. (turn_to satellite0 star0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star0)
   goals met: 3 of 5
19. (turn_to satellite1 planet9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet9)
   goals met: 3 of 5
20. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 5
21. (take_image satellite1 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 4 of 5
22. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 5
23. (take_image satellite0 phenomenon11 instrument0 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 5 of 5
